#ifndef _MCP2515_H_
#define _MCP2515_H_
#define MCP2515_BASE    0x00 //	 ¶¨ÒåMCP2515µÄ»ùÖ·

/*************************************************************************************************
    ÒÔÏÂÎª¶¨ÒåMCP2515µÄÄÚ²¿ÌØÊâ¹¦ÄÜ¼Ä´æÆ÷µÄµØÖ·£¬¸÷ÌØÊâ¹¦ÄÜ¼Ä´æÆ÷µÄ¾ßÌå¹¦ÄÜÇë²éÔÄMCP2515µÄÊý¾ÝÊÖ²á
**************************************************************************************************/

#define TXB0CTRL	MCP2515_BASE + 0x30  //·¢ËÍ»º³åÇø0¿ØÖÆ¼Ä´æÆ÷
#define TXB1CTRL	MCP2515_BASE + 0x40  //·¢ËÍ»º³åÇø1¿ØÖÆ¼Ä´æÆ÷
#define TXB2CTRL	MCP2515_BASE + 0x50  //·¢ËÍ»º³åÇø2¿ØÖÆ¼Ä´æÆ÷
#define TXRTSCTRL	MCP2515_BASE + 0x0d  //·¢ËÍÇëÇóÒý½ÅÅäÖÃ¼Ä´æÆ÷
#define TXB0SIDH 	MCP2515_BASE + 0x31  //±ê×¼±êÊ¶·û¸ß×Ö½Ú
#define TXB0SIDL 	MCP2515_BASE + 0x32  //±ê×¼±êÊ¶·ûµÍ×Ö½Ú
#define TXB1SIDH 	MCP2515_BASE + 0x41  //±ê×¼±êÊ¶·û¸ß×Ö½Ú
#define TXB1SIDL 	MCP2515_BASE + 0x42  //±ê×¼±êÊ¶·û¸ß×Ö½Ú
#define TXB2SIDH 	MCP2515_BASE + 0x51  //±ê×¼±êÊ¶·û¸ß×Ö½Ú
#define TXB2SIDL 	MCP2515_BASE + 0x52  //±ê×¼±êÊ¶·ûµÍ×Ö½Ú
#define TXB0EID8	MCP2515_BASE + 0x33  //À©Õ¹±êÊ¶·û¸ß×Ö½Ú
#define TXB0EID0	MCP2515_BASE + 0x34  //À©Õ¹±êÊ¶·ûµÍ×Ö½Ú
#define TXB1EID8	MCP2515_BASE + 0x43  //À©Õ¹±êÊ¶·û¸ß×Ö½Ú
#define TXB1EID0	MCP2515_BASE + 0x44  //À©Õ¹±êÊ¶·ûµÍ×Ö½Ú
#define TXB2EID8	MCP2515_BASE + 0x53  //À©Õ¹±êÊ¶·û¸ß×Ö½Ú
#define TXB2EID0	MCP2515_BASE + 0x54  //À©Õ¹±êÊ¶·ûµÍ×Ö½Ú
#define TXB0DLC		MCP2515_BASE + 0x35  //·¢ËÍ»º´æÇø0Êý¾Ý³¤¶È¼Ä´æÆ÷
#define TXB1DLC		MCP2515_BASE + 0x45  //·¢ËÍ»º´æÇø0Êý¾Ý³¤¶È¼Ä´æÆ÷
#define TXB2DLC		MCP2515_BASE + 0x55  //·¢ËÍ»º´æÇø0Êý¾Ý³¤¶È¼Ä´æÆ÷
#define TXB0D_BASE	MCP2515_BASE + 0x36  //·¢ËÍËç³åÇø0Êý¾Ý¼Ä´æÆ÷ÆðÊ¼µØÖ·
#define TXB1D_BASE	MCP2515_BASE + 0x46  //·¢ËÍËç³åÇø1Êý¾Ý¼Ä´æÆ÷ÆðÊ¼µØÖ·
#define TXB2D_BASE	MCP2515_BASE + 0x56  //·¢ËÍËç³åÇø2Êý¾Ý¼Ä´æÆ÷ÆðÊ¼µØÖ·
#define RXB0CTRL	MCP2515_BASE + 0x60  //½ÓÊÕ»º³åÇø0¿ØÖÆ¼Ä´æÆ÷
#define RXB1CTRL	MCP2515_BASE + 0x70  //½ÓÊÕ»º³åÇø1¿ØÖÆ¼Ä´æÆ÷
#define BFPCTRL		MCP2515_BASE + 0x0c  //½ÓÊÕÒý½Å¿ØÖÆºÍ×´Ì¬¼Ä´æÆ÷
#define RXB0SIDH	MCP2515_BASE + 0x61  //½ÓÊÕ»º³åÆ÷0±ê×¼±êÊ¶·û¸ß×Ö½Ú
#define RXB0SIDL	MCP2515_BASE + 0x62  //½ÓÊÕ»º³åÆ÷0±ê×¼±êÊ¶·ûµÍ×Ö½Ú
#define RXB1SIDH	MCP2515_BASE + 0x71  //½ÓÊÕ»º³åÆ÷1±ê×¼±êÊ¶·û¸ß×Ö½Ú
#define RXB1SIDL	MCP2515_BASE + 0x72  //½ÓÊÕ»º³åÆ÷1±ê×¼±êÊ¶·û¸ß×Ö½Ú
#define RXB0EID8	MCP2515_BASE + 0x63  //½ÓÊÕ»º³åÇø0À©Õ¹±êÊ¶·û¸ß×Ö½Ú
#define RXB0EID0	MCP2515_BASE + 0x64  //½ÓÊÕ»º³åÇø0À©Õ¹±êÊ¶·ûµÍ×Ö½Ú
#define RXB1EID8	MCP2515_BASE + 0x73  //½ÓÊÕ»º³åÇø1À©Õ¹±êÊ¶·û¸ß×Ö½Ú
#define RXB1EID0	MCP2515_BASE + 0x74  //½ÓÊÕ»º³åÇø1À©Õ¹±êÊ¶·ûµÍ×Ö½Ú
#define RXB0DLC		MCP2515_BASE + 0x65	 //½ÓÊÕ»º³åÇø0Êý¾ÝÂë³¤¶È
#define RXB1DLC		MCP2515_BASE + 0x75	 //½ÓÊÕ»º³åÇø1Êý¾ÝÂë³¤¶È
#define RXB0D_BASE	MCP2515_BASE + 0x66  //½ÓÊÕ»º³åÇø0Êý¾Ý¼Ä´æÆ÷ÆðÊ¼µØÖ·
#define RXB1D_BASE	MCP2515_BASE + 0x76  //½ÓÊÕ»º³åÇø1Êý¾Ý¼Ä´æÆ÷ÆðÊ¼µØÖ·

#define RXF0SIDH	MCP2515_BASE + 0x00  //ÑéÊÕÂË²¨Æ÷0±ê×¼±êÊ¶·û¸ß×Ö½Ú
#define RXF0SIDL	MCP2515_BASE + 0x01  //ÑéÊÕÂË²¨Æ÷0±ê×¼±êÊ¶·ûµÍ×Ö½Ú
#define RXF1SIDH	MCP2515_BASE + 0x04  //ÑéÊÕÂË²¨Æ÷1±ê×¼±êÊ¶·û¸ß×Ö½Ú
#define RXF1SIDL	MCP2515_BASE + 0x05  //ÑéÊÕÂË²¨Æ÷1±ê×¼±êÊ¶·ûµÍ×Ö½Ú
#define RXF2SIDH	MCP2515_BASE + 0x08  //ÑéÊÕÂË²¨Æ÷2±ê×¼±êÊ¶·û¸ß×Ö½Ú
#define RXF2SIDL	MCP2515_BASE + 0x09  //ÑéÊÕÂË²¨Æ÷2±ê×¼±êÊ¶·ûµÍ×Ö½Ú
#define RXF3SIDH	MCP2515_BASE + 0x10  //ÑéÊÕÂË²¨Æ÷3±ê×¼±êÊ¶·û¸ß×Ö½Ú
#define RXF3SIDL	MCP2515_BASE + 0x11  //ÑéÊÕÂË²¨Æ÷3±ê×¼±êÊ¶·ûµÍ×Ö½Ú
#define RXF4SIDH	MCP2515_BASE + 0x14  //ÑéÊÕÂË²¨Æ÷4±ê×¼±êÊ¶·û¸ß×Ö½Ú
#define RXF4SIDL	MCP2515_BASE + 0x15  //ÑéÊÕÂË²¨Æ÷4±ê×¼±êÊ¶·ûµÍ×Ö½Ú
#define RXF5SIDH	MCP2515_BASE + 0x18  //ÑéÊÕÂË²¨Æ÷5±ê×¼±êÊ¶·û¸ß×Ö½Ú
#define RXF5SIDL	MCP2515_BASE + 0x19  //ÑéÊÕÂË²¨Æ÷5±ê×¼±êÊ¶·ûµÍ×Ö½Ú

#define RXF0EID8	MCP2515_BASE + 0x02  //ÑéÊÕÂË²¨Æ÷0À©Õ¹±êÊ¶·û¸ß×Ö½Ú
#define RXF0EID0	MCP2515_BASE + 0x03  //ÑéÊÕÂË²¨Æ÷0À©Õ¹±êÊ¶·ûµÍ×Ö½Ú
#define RXF1EID8	MCP2515_BASE + 0x06  //ÑéÊÕÂË²¨Æ÷1À©Õ¹±êÊ¶·û¸ß×Ö½Ú
#define RXF1EID0	MCP2515_BASE + 0x07  //ÑéÊÕÂË²¨Æ÷1À©Õ¹±êÊ¶·ûµÍ×Ö½Ú
#define RXF2EID8	MCP2515_BASE + 0x0a  //ÑéÊÕÂË²¨Æ÷2À©Õ¹±êÊ¶·û¸ß×Ö½Ú
#define RXF2EID0	MCP2515_BASE + 0x0b  //ÑéÊÕÂË²¨Æ÷2À©Õ¹±êÊ¶·ûµÍ×Ö½Ú
#define RXF3EID8	MCP2515_BASE + 0x12  //ÑéÊÕÂË²¨Æ÷3À©Õ¹±êÊ¶·û¸ß×Ö½Ú
#define RXF3EID0	MCP2515_BASE + 0x13  //ÑéÊÕÂË²¨Æ÷3À©Õ¹±êÊ¶·ûµÍ×Ö½Ú
#define RXF4EID8	MCP2515_BASE + 0x16  //ÑéÊÕÂË²¨Æ÷4À©Õ¹±êÊ¶·û¸ß×Ö½Ú
#define RXF4EID0	MCP2515_BASE + 0x17  //ÑéÊÕÂË²¨Æ÷4À©Õ¹±êÊ¶·ûµÍ×Ö½Ú
#define RXF5EID8	MCP2515_BASE + 0x1a  //ÑéÊÕÂË²¨Æ÷5À©Õ¹±êÊ¶·û¸ß×Ö½Ú
#define RXF5EID0	MCP2515_BASE + 0x1b  //ÑéÊÕÂË²¨Æ÷5À©Õ¹±êÊ¶·ûµÍ×Ö½Ú

#define RXM0SIDH	MCP2515_BASE + 0x20  //ÑéÊÕÆÁ±Î¼Ä´æÆ÷0±ê×¼±êÊ¶·û¸ß×Ö½Ú
#define RXM0SIDL	MCP2515_BASE + 0x21  //ÑéÊÕÆÁ±Î¼Ä´æÆ÷0±ê×¼±êÊ¶·ûµÍ×Ö½Ú
#define RXM1SIDH	MCP2515_BASE + 0x24  //ÑéÊÕÆÁ±Î¼Ä´æÆ÷1±ê×¼±êÊ¶·û¸ß×Ö½Ú
#define RXM1SIDL	MCP2515_BASE + 0x25  //ÑéÊÕÆÁ±Î¼Ä´æÆ÷1±ê×¼±êÊ¶·ûµÍ×Ö½Ú

#define RXM0EID8	MCP2515_BASE + 0x22  //ÑéÊÕÆÁ±Î¼Ä´æÆ÷0À©Õ¹±êÊ¶·û¸ß×Ö½Ú
#define RXM0EID0	MCP2515_BASE + 0x26  //ÑéÊÕÆÁ±Î¼Ä´æÆ÷0À©Õ¹±êÊ¶·ûµÍ×Ö½Ú
#define RXM1EID8	MCP2515_BASE + 0x23  //ÑéÊÕÆÁ±Î¼Ä´æÆ÷1À©Õ¹±êÊ¶·û¸ß×Ö½Ú
#define RXM1EID0	MCP2515_BASE + 0x27  //ÑéÊÕÆÁ±Î¼Ä´æÆ÷1À©Õ¹±êÊ¶·ûµÍ×Ö½Ú

#define CNF1		MCP2515_BASE + 0x2a  //ÅäÖÃ¼Ä´æÆ÷1
#define CNF2		MCP2515_BASE + 0x29  //ÅäÖÃ¼Ä´æÆ÷2
#define CNF3		MCP2515_BASE + 0x28  //ÅäÖÃ¼Ä´æÆ÷3
#define TEC			MCP2515_BASE + 0x1c  //·¢ËÍ´íÎó¼ÆÊýÆ÷
#define REC			MCP2515_BASE + 0x1d  //½ÓÊÕ´íÎó¼ÆÊýÆ÷
#define EFLG		MCP2515_BASE + 0x2d  //´íÎó±êÖ¾¼Ä´æÆ÷£¬×î¸ß2Î»±ØÐëÓÉMCU¸´Î»
#define CANINTE		MCP2515_BASE + 0x2b  //ÖÐ¶ÏÊ¹ÄÜ¼Ä´æÆ÷
#define CANINTF		MCP2515_BASE + 0x2c  //ÖÐ¶Ï±êÖ¾¼Ä´æÆ÷£¬Ð´0ÔòÇå³ýÏàÓ¦µÄÖÐ¶Ï£»
#define CANCTRL		MCP2515_BASE + 0x0f  //CAN¿ØÖÆ¼Ä´æÆ÷
#define CANSTAT		MCP2515_BASE + 0x0e  //CAN×´Ì¬¼Ä´æÆ÷

/************************************************************************************
			¶¨ÒåEFLG´íÎó±êÖ¾¼Ä´æÆ÷µÄÃüÁî×Ö
************************************************************************************/
#define EWARN		0x01<<0 			//´íÎó¾¯¸æ¼Ä´æÆ÷£¬µ±TEC»òREC´óÓÚµÈÓÚ96Ê±ÖÃ1
#define RXWAR		0x01<<1 			//µ±REC´óÓÚµÈÓÚ96Ê±ÖÃ1
#define TXWAR		0x01<<2 			//µ±TEC´óÓÚµÈÓÚ96Ê±ÖÃ1
#define RXEP		0x01<<3 			//µ±REC´óÓÚµÈÓÚ128Ê±ÖÃ1
#define TXEP		0x01<<4 			//µ±TEC´óÓÚµÈÓÚ128Ê±ÖÃ1
#define TXBO		0x01<<5 			//µ±TEC´óÓÚµÈÓÚ255Ê±ÖÃ1
#define RX0OVR 		0x01<<6				//½ÓÊÕ»º³åÇø0Òç³ö
#define RX1OVR 		0x01<<7				//½ÓÊÕ»º³åÇø1Òç³ö
/************************************************************************************
			¶¨ÒåTXBnCTRL¼Ä´æÆ÷µÄÃüÁî×Ö
************************************************************************************/
#define TXREQ		0x08				//±¨ÎÄ·¢ËÍÇëÇóÎ»
#define ABTF		0x40				//±¨ÎÄ·¢ËÍÖÐÖ¹±ê¼ÇÎ»
/****************TXBnDLC¼Ä´æÆ÷ºÍRXBnDLC¼Ä´æÆ÷*********************/
#define RTR 		0x40				//Ô¶³Ì·¢ËÍÇëÇóÎ»
/**************TXBnSIDL¼Ä´æÆ÷ºÍRXFnSIDL¼Ä´æÆ÷****************/
#define EXIDE 		0x08				//À©Õ¹±êÊ¶·ûÊ¹ÄÜÎ»
/**************RXBnSIDL¼Ä´æÆ÷****************/
#define IDE			0x08				//À©Õ¹±êÊ¶·û±êÖ¾Î»£¬¸ÃÎ»±íÃ÷ÊÕµ½µÄ±¨ÎÄÊÇ±ê×¼Ö¡»¹ÊÇÀ©Õ¹Ö¡
#define SRR			0x10 				//Ô¶³Ì·¢ËÍÇëÇóÎ»£¨Ö»ÓÐµ±IDEÎ» = 0Ê±ÓÐÐ§£©
/************************************************************************************
			        ¶¨ÒåMCP2515ÖÐ¶ÏÊ¹ÄÜ¼Ä´æÆ÷µÄÃüÁî×Ö
************************************************************************************/
#define MERRF		0x80				//±¨ÎÄ´íÎóÖÐ¶ÏÊ¹ÄÜÎ»
#define WAKIF		0x40				//»½ÐÑÖÐ¶ÏÊ¹ÄÜÎ»
#define ERRIF		0x20				//´íÎóÖÐ¶ÏÊ¹ÄÜÎ»
#define TX2IF		0x10				//·¢ËÍ»º³åÆ÷2¿ÕÖÐ¶ÏÊ¹ÄÜÎ»
#define TX1IF		0x08				//·¢ËÍ»º³åÆ÷1¿ÕÖÐ¶ÏÊ¹ÄÜÎ»
#define TX0IF		0x04				//·¢ËÍ»º³åÆ÷0¿ÕÖÐ¶ÏÊ¹ÄÜÎ»
#define RX1IF		0x02				//½ÓÊÕ»º³åÆ÷1ÂúÖÐ¶ÏÊ¹ÄÜÎ»
#define RX0IF		0x01				//½ÓÊÕ»º³åÆ÷0ÂúÖÐ¶ÏÊ¹ÄÜÎ»
/************************************************************************************
			        ¶¨ÒåMCP2515²Ù×÷µÄÃüÁî×Ö
************************************************************************************/
#define CAN_RESET 		0xc0				//¸´Î»ÃüÁî
#define CAN_W			0x02				//Ð´ÃüÁî+£¨µØÖ·+Êý¾Ý£©
#define CAN_W_BUFFER	0x40			//×°ÔØ·¢ËÍ»º³åÇøÃüÁî[0-2]
 								//000 Ö¸ÕëÆðÊ¼ÓÚTXB0SIDH£»001Ö¸ÕëÆðÊ¼ÓÚTXB0D0				
								//010 Ö¸ÕëÆðÊ¼ÓÚTXB1SIDH£»001Ö¸ÕëÆðÊ¼ÓÚTXB0D1
								//100 Ö¸ÕëÆðÈçÓÚTXB2SIDH£»101Ö¸ÕëÆðÊ¼ÓÚTXB0D2
#define CAN_R			0x03				//¶ÁÃüÁî+£¨µØÖ·£©
#define CAN_R_BUFFER	0x90				//¶ÁËç³åÇøÖ¸Áî[1-2]00Ö¸ÕëÆðÊ¼ÓÚRXB0SIDH;01Ö¸ÕëÆðÊ¼ÓÚRXB0D0
											//10 Ö¸ÕëÆðÊ¼ÓÚRXB1SIDH;11Ö¸ÕëÆðÊ¼ÓÚRXB1D0
#define CAN_R_STATE		0xa0				//¶Á×´Ì¬ÃüÁî
#define CAN_RX 			0xb0				//¶Á³ö½ÓÊÕ»º³åÇøµÄ×´Ì¬
#define CAN_M_BIT		0x01				//Î»ÐÞ¸ÄÃüÁî+µØÖ·+ÆÁ±Î×Ö½Ú+Êý¾Ý×Ö½Ú
#define CAN_RTS			0x80				//ÇëÇó·¢ËÍÃüÁî[0-3]000ÎÞ·¢ËÍ£»001 TX0;010 TX1;100 TX2

/************************************************************************************
			        ¶¨ÒåMCP2515µÄCAN¹¤×÷Ä£Ê½
************************************************************************************/
#define CAN_Config_Mode 		0x80			//ÅäÖÃÄ£Ê½
#define CAN_Listen_Only_Mode	0x60			//½ö¼àÌýÄ£Ê½
#define CAN_LoopBack_Mode		0x40			//»·»ØÄ£Ê½
#define CAN_Sleep_Mode			0x20			//ÐÝÃßÄ£Ê½
#define	CAN_Normal_Mode			0x00			//Õý³£¹¤×÷Ä£Ê½
/************************************************************************************
			        ¶¨ÒåMCP2515µÄCAN¹¤×÷Ä£Ê½
************************************************************************************/
#define CAN_I_RESET				0xc0			//¸´Î»
#define CAN_I_READ				0x03			//´Ó¼Ä´æÆ÷ÖÐ¶Á³öÊý¾Ý
#define	CAN_I_READ_RX			0x90			//¶ÁRX»º³åÆ÷Ö¸Áî
#define CAN_I_WRITE				0x02			//Ïò¼Ä´æÆ÷ÖÐÐ´ÈëÊý¾Ý
#define CAN_I_WRITE_TX			0x40			//×°ÔØTX»º³åÆ÷Ö¸Áî
#define CAN_I_RTS				0x80			//·¢ËÍÇëÇó
#define CAN_I_READ_STATE		0xa0			//¶ÁÈ¡¼Ä´æÆ÷×´Ì¬
#define	CAN_I_RX_STATE			0xb0			//¿ìËÙÈ·¶¨Óë±¨ÎÄºÍ±¨ÎÄÀàÐÍÏàÆ¥ÅäµÄÂË²¨Æ÷
#define CAN_I_BIT_CHANGE		0x05			//Î»ÐÞ¸ÄÖ¸Áî
#endif
